"""เขียนโปรแกรมคำนวณความได้เปรียบเสียเปรียบของหมากรุก
โดยคำนวณจากหมากที่เหลืออยู่บนกระดานว่าตอนนี้เราได้เปรียบหรือเสียเปรียบอยู่เท่าใดหากได้เปรียบให้แสดงค่าเป็นจำนวนเต็มบวก
และถ้าเสียเปรียบให้แสดงค่าเป็นจำนวนเต็มลบ ซึ่งเราะใช้ตัวอักษรพิมพ์ใหญ่แทนหมากของเรา
โดยค่าของหมากแต่ละตัวจะแตกต่างออกไปดังนี้
Pawn: P,p  มีค่า 1 คะแนน
Knight: N,n มีค่า 3 คะแนน
Bishop: B,b มีค่า 3 คะแนน
Rook: R,r  มีค่า 5 คะแนน
Queen: Q,q มีค่า 9 คะแนน
King: K,k  มีค่า 0 คะแนน"""
x = 0
for i in range(8):
    a = input()
    for j in a:
        if j == "P":
            x += 1
        if j == "N" or j == "B":
            x += 3
        if j == "R":
            x += 5
        if j == "Q":
            x += 9
        if j == "p":
            x -= 1
        if j == "n" or j == "b":
            x -= 3
        if j == "r":
            x -= 5
        if j == "q":
            x -= 9
if x != 0:
    print(x)
else:
    print("equal")
