"""ช่วงนี้ร้านแพนเค้กขาดทุน ดังนั้นจึงจัดโปรโมชั่นใหม่ ดังนี้
แถมคูปองและถาดรองแพนเค้กให้ โดย 1 คูปอง/ชิ้น และ 1 ถาด/ชิ้น ทุกครั้งที่ได้รับแพนเค้กจากร้านนี้
เมื่อสะสมครบ 2 คูปอง จะสามารถนำมาแลกแพนเค้กเพิ่มได้ 1 ชิ้นฟรี
เมื่อสะสมครบ 4 ถาด จะสามารถนำมาแลกแพนเต้กเพิ่มได้ 1 ชิ้นฟรี
คุณเป็นโปรแกรมเมอร์หัวไว เมื่อเห็นโปรโมชั่นของร้านนี้แล้ว จึงกลับมาคิดว่า ถ้ามีเงินอยู่ n บาท และแพนเค้กชิ้นละ k บาท จะได้รับแพนเค้กมากสุดกี่ชิ้น???"""

b = input().split(" ")
a = int(b[0]) // int(b[1])
coupon, tart, sum_pancake = a, a, a

while coupon >= 2 or tart >= 4:
    if coupon >= 2:
        re_coupon = coupon // 2  # กำหนดจำนวนแพนเค้กที่แลกได้
        sum_pancake += re_coupon  # เพิ่มแพนเค้กรวมด้วยแพนเค้กที่แลกได้
        coupon -= re_coupon * 2  # แลกคูปอง
        coupon += re_coupon  # ได้คูปองเพิ่มตามจำนวนที่แลกได้
        tart += re_coupon  # ได้ถาดเพิ่มตามจำนวนที่แลกได้
    if tart >= 4:
        re_tart = tart // 4
        sum_pancake += re_tart
        tart -= re_tart * 4
        tart += re_tart
        coupon += re_tart
print(sum_pancake)
